#include<stdio.h>

int main(void){
	int num[]={125814,225547,132254,224321,352124,342214,382154,321014,112254,153789};	/*‹‹—¿*/
	int numm[]={10000,5000,1000,500,100,50,10,5,1};						/*‚¨‹à‚Ì—Ê*/
	int n[]={0,0,0,0,0,0,0,0,0,0};								/*–‡”*/
	int i, j;										/*ŒJ‚è•Ô‚µ—p*/
	for(i=0;i<=9;i++){
		for(j=0;j<=8;j++){
			while(num[i]>=numm[j]){							/*‹‹—¿‚ª‚ ‚é‚¨‹àˆê‚ÂŠz‚ğ‰º‰ñ‚é‚Ü‚Å*/
				num[i]=num[i]-numm[j];
				n[j]=n[j]+1;
			}
		}
	}
	for(i=0;i<=8;i++){
		printf("%5d‰~%6d–‡\n",numm[i],n[i]);						/*Œ‹‰Ê‚Ì•\¦*/
	}
	return 0;
}
